# A tool by Hacker X Phantom 
# if u copy Give Me Credit
# Colours
#-----------------
red="\e[91m"
rset="\e[0m"
grn="\e[92m"
ylo="\e[93m"
blue="\e[94m"
cyan="\e[96m"
pink="\e[95m"
#-----------------
# scripting start
banner(){
clear
echo -e '\e[91m           
.                         ▄          ▄
                          █▄        ██
                          ███     ▄███
                          ████████████
                          ████████████
                         ▄████████████
                        ▄██▀███████▀███
                        ███░▄██████░▄██▄
                       ▄████████████████
                       █████████████████
                       █████████████████
                    ▄                     ▄▄
                   ███░█████████████████░▄███
                  ████░█████████████████░████ 
                  ████░█████████████████░████
                  ████░█████████████████░████ 
                  ████░█████████████████░████ 
                  ████░█████████████████░████
                  ████░█████████████████░████
                  ████░█████████████████░████ 
                  ████░█████████████████░████
                   ███░█████████████████░▀███
                    ▀  █████████████████  ▀▀
                       █████████████████
                       ▀████████████████
                        ▀▀▀███▀▀▀████▀▀
                           ███   ████
                           ███   ████
                           ███   ████
                           ███   ████
                           ███   ████
                           ▀█▀    ██

'
echo " " 
echo -e "$red ~~> $grn my channel Telegram = @Filtering_Hacking $red<~~$rset"
echo 
# Functions
echo -e "$red ~~>$grn my id Telegram = @tacklorix $red<~~$rset"
echo " "
echo " "
}
baner1(){
clear
echo -e '\e[91m               
.                         ▄          ▄
                          █▄        ██
                          ███     ▄███
                          ████████████
                          ████████████
                         ▄████████████
                        ▄██▀███████▀███
                        ███░▄██████░▄██▄
                       ▄████████████████
                       █████████████████
                       █████████████████
                    ▄                     ▄▄
                   ███░█████████████████░▄███
                  ████░█████████████████░████ 
                  ████░█████████████████░████
                  ████░█████████████████░████ 
                  ████░█████████████████░████ 
                  ████░█████████████████░████ 
                  ████░█████████████████░████
                  ████░█████████████████░████
                  ████░█████████████████░████ 
                  ████░█████████████████░████
                   ███░█████████████████░▀███
                    ▀  █████████████████  ▀▀
                       █████████████████
                       ▀████████████████
                        ▀▀▀███▀▀▀████▀▀
                           ███   ████
                           ███   ████
                           ███   ████
                           ███   ████
                           ███   ████
                           ▀█▀    ██
'
echo " "
echo -e "$red ~~>$grn my channel Telegram = @SARHANG_HRX $red<~~$rset"
echo
# Functions
echo -e "$red ~~>$grn my id Telegram = @SARHANG_HRX $red<~~$rset"
echo " "
echo " "
}
menu(){
echo -e "$red <-$ylo sarhang $red ->$rset"
echo " "
echo " "
echo -e "$red />$cyan [\e[94m1\e[96m]\e[96mVirus show"
echo -e "$red />$cyan [\e[94m2\e[96m]\e[96mVirus web & malware"
echo -e "$red />$cyan [\e[94m5\e[96m]\e[95mExit"
echo " "
echo " "
echo -e "$red <-$ylo SARHANG $red ->$rset"
echo " "
echo -ne "\e[92m %> chois your number \e[92m: "
read optnz
if [ $optnz = "1" ];
then
virus
elif [ $optnz = "2" ];
then
save
banner
menu
elif [ $optnz = "5" ];
then
exit 1
else
echo "wrong"
exit
fi
}
virus(){
################
clear
echo
echo -e '\e[94m 
▄▄▄▄       ▄▄     ▄▄▄▄▄▄    ▄▄    ▄▄     ▄▄     ▄▄▄   ▄▄     ▄▄▄▄
 ▄█▀▀▀▀█     ████    ██▀▀▀▀██  ██    ██    ████    ███   ██   ██▀▀▀▀█
 ██▄         ████    ██    ██  ██    ██    ████    ██▀█  ██  ██
  ▀████▄    ██  ██   ███████   ████████   ██  ██   ██ ██ ██  ██  ▄▄▄▄
      ▀██   ██████   ██  ▀██▄  ██    ██   ██████   ██  █▄██  ██  ▀▀██
 █▄▄▄▄▄█▀  ▄██  ██▄  ██    ██  ██    ██  ▄██  ██▄  ██   ███   ██▄▄▄██
  ▀▀▀▀▀    ▀▀    ▀▀  ▀▀    ▀▀▀ ▀▀    ▀▀  ▀▀    ▀▀  ▀▀   ▀▀▀     ▀▀▀▀
echo " "
echo -e "     \e[91m  links virus show :
         
\e[91m-->\e[94m    bash👇

\e[91m/>\e[92m  https://github.com/Projektiohack/link-virusv2/blob/main/virus.sh

\e[91m/>\e[92m  https://github.com/WhoAmI-T1T4N/Link-Virus/blob/main/Virus_Link.sh

\e[91m/>\e[92m  https://github.com/Azka-afk/Link-Virus/blob/main/LinkVirus.sh

\e[91m/>\e[92m  https://github.com/DBDJKK09/Link-Virus-controlar-PC/blob/main/PC-Virus-Intrucciones



\e[91m--->\e[94m   python👇

\e[91m/>\e[92m  https://github.com/akshshu/Virus-Clustering-using-Complete-Linkage-Hierarchical-Clustering-Technique/blob/master/20CS60R40_VC4.py

\e[91m/>\e[92m  https://github.com/gunslinger/Python-VirusTotal-link-scanner/blob/master/main.py



\e[91m--->\e[94m   txt 👇
\e[91m/>\e[92m  https://github.com/MrVirusSpm-07/link-virus/blob/main/LiNk1.sh

\e[91m/>\e[92m  https://hiddenlayer.com/research/crossing-the-rubika-the-use-and-abuse-of-ai-cloud-services



\e[91m--->\e[94m   site 👇

\e[91m/>\e[92m  https://www.virustotal.com



\e[91m--->\e[94m   coded👇

\e[91m/>\e[92m  https://liveweave.com/JUcnd7


                            \e[93m (- SARHANG  -)
"
echo
echo -ne "\e[92m%> Type 8 fore exit : "
read exitz
if [ $exitz = "exit" ];
then
banner
menu
else
banner
menu
fi
}
save(){
clear
echo
echo -e '\e[94m 
▄▄▄▄       ▄▄     ▄▄▄▄▄▄    ▄▄    ▄▄     ▄▄     ▄▄▄   ▄▄     ▄▄▄▄
 ▄█▀▀▀▀█     ████    ██▀▀▀▀██  ██    ██    ████    ███   ██   ██▀▀▀▀█
 ██▄         ████    ██    ██  ██    ██    ████    ██▀█  ██  ██
  ▀████▄    ██  ██   ███████   ████████   ██  ██   ██ ██ ██  ██  ▄▄▄▄
      ▀██   ██████   ██  ▀██▄  ██    ██   ██████   ██  █▄██  ██  ▀▀██
 █▄▄▄▄▄█▀  ▄██  ██▄  ██    ██  ██    ██  ▄██  ██▄  ██   ███   ██▄▄▄██
  ▀▀▀▀▀    ▀▀    ▀▀  ▀▀    ▀▀▀ ▀▀    ▀▀  ▀▀    ▀▀  ▀▀   ▀▀▀     ▀▀▀▀
'
echo " "
echo " "
echo -e "     \e[91m  Links web virusy & links download malware :

      \e[95m Web Virusy : 
           
        
\e[91m/>\e[92m  17ebook.co
\e[91m/>\e[92m  aladel.net
\e[91m/>\e[92m  bpwhamburgorchardpark.org
\e[91m/>\e[92m  clicnews.com
\e[91m/>\e[92m  dfwdiesel.net
\e[91m/>\e[92m  divineenterprises.net
\e[91m/>\e[92m  fantasticfilms.ru
\e[91m/>\e[92m  gardensrestaurantandcatering.com
\e[91m/>\e[92m  ginedis.com
\e[91m/>\e[92m  gncr.org
\e[91m/>\e[92m  hdvideoforums.org
\e[91m/>\e[92m  hihanin.com
\e[91m/>\e[92m  kingfamilyphotoalbum.com
\e[91m/>\e[92m  likaraoke.com
\e[91m/>\e[92m  mactep.org
\e[91m/>\e[92m  magic4you.nu
\e[91m/>\e[92m  marbling.pe.kr
\e[91m/>\e[92m  nacjalneg.info
\e[91m/>\e[92m  pronline.ru
\e[91m/>\e[92m  purplehoodie.com
\e[91m/>\e[92m  qsng.cn
\e[91m/>\e[92m  seksburada.net
\e[91m/>\e[92m  sportsmansclub.net
\e[91m/>\e[92m  stock888.cn
\e[91m/>\e[92m  tathli.com
\e[91m/>\e[92m  teamclouds.com
\e[91m/>\e[92m  texaswhitetailfever.com
\e[91m/>\e[92m  wadefamilytree.org
\e[91m/>\e[92m  xnescat.info   

      \e[95m download malware :  \e[92m


\e[91m/>\e[92m  http://www.tekdefense.com/downloads/malware-samples/newbos2.exe.zip


\e[91m/>\e[92m  http://www.tekdefense.com/downloads/malware-samples/tekdefense.zip


\e[91m/>\e[92m  http://www.tekdefense.com/downloads/malware-samples/KUNKRNMALWARESAMPLE.rar


\e[91m/>\e[92m  http://www.tekdefense.com/downloads/malware-samples/MALZ6.zip


\e[91m/>\e[92m  http://www.tekdefense.com/downloads/malware-samples/TekDefense.7z

\e[91m/>\e[92m  http://www.tekdefense.com/downloads/malware-samples/1.exe.zip


\e[91m/>\e[92m  http://www.tekdefense.com/downloads/malware-samples/0.exe.zip



                               \e[93m (- sarhang -)

"
echo
echo -ne "\e[92m%> Type 8 fore exit : "
read exitz
if [ $exitz = "exit" ];
then
banner
menu
else
banner
menu
fi
}
banner
menu
